/**
*@file LibClass.h
*@brief Lib_Classのヘッダーファイルをまとめたヘッダーファイルです.
*
*/

#ifndef LIB_CLASS_H
#define LIB_CLASS_H

//--------------------------------------------
//　　　　　グラフィックス関連
//--------------------------------------------
#include"GraphicsD3D.h"
#include"Texture.h"


//-------------------------------------------
//　　　　　　DirectInput関連
//-------------------------------------------
#include"InputDevice.h"
#include"InputKey.h"

//-------------------------------------------
//				サウンド関連
//-------------------------------------------
#include"DSound.h"
#include"SoundPlayer.h"

//-------------------------------------------
//　　　　　ウィンドウズ関連
//-------------------------------------------

#include"WindowObject.h"

#endif